#Список словників, де кожен словник представляє певний продаж
sales = [
    {'продукт': 'яблука', 'кількість': 30, 'ціна': 10},
    {'продукт': 'яблука', 'кількість': 20, 'ціна': 10},
    {'продукт': 'банани', 'кількість': 50, 'ціна': 20},
    {'продукт': 'апельсини', 'кількість': 10, 'ціна': 30},
    {'продукт': 'банани', 'кількість': 20, 'ціна': 20},
]

#Функція обчислення доходу
def calculate_income(sales_list):
    # Словник який містить інформацію про продукт та дохід з цього продукту
    income = {}
    #Цикл переору кожного продажу (одного словника)
    for sale in sales_list:
        product=sale['продукт'] #дістаємо назву продукту
        quantity=sale['кількість'] #дістаємо кількість продукту
        price=sale['ціна'] #дістаємо ціну продукту
        total=quantity*price #рахуємо дохід з одного продажу
        #Перевірка чи є вже такий продукт у словнику доходів
        if product in income:
            income[product] += total #якщо продукт уже є - додаємо
        else:
            income[product] = total #якщо немає - створюємо

    return income
result=calculate_income(sales)
print("Словник з доходами від кожного продукта:", result)
#Список продуктів із доходом > 1000
high_income_products=[]
for product_name in result:
    if result[product_name] > 1000:
        high_income_products.append(product_name)
print("Продукти з доходом > 1000", high_income_products)
