import re #бібліотека для функції, щоб прибрати непотрібні знаки в тексті
text=input("Введіть рядок для аналізу:") # вводимо текст
text=text.lower() #для корректного аналізу тексту, приводимо всі символи до маленьких
text=re.sub(r"[^\w\s]", "", text) #прибираємо розділові знаки [^/w/s] - усе що не букви й не пробіли, замінюємо на "", тобто нічого
words=text.split() #розб'ємо текст на слова та запишемо в змінну words, тобто це масив зі словами з тексту text
#зробимо словник в котрому запишемо слова і їх кільіксть у тексті
word_counts={} #створюємо порожній словник
for word in words: #перебираємо кожне слово в списку(масиві) (тобто йдемо по кожному елементу масива), слово записується в word, після йде аргумент
    if word in word_counts: #аргумент, якщо слово вже є в словнику, то виконати збільшення лічильника [word] в word_counts[word]
        word_counts[word]+= 1
    else: #якщо аргумент не виконується, тобто слова немає в словнику, то запишемо слово зі значенням 1
        word_counts[word]=1
popular_words=[] #створимо інший масив, в котрому будемо зберігати слова які зустрічаються понад трьох раз
for word in word_counts: #знову робимо цикл, і перебираєємо кожен ключ (word) у словнику word_counts
    if word_counts[word]>3: #перевіряємо чи значення понад трьох, чи ні (тобто, чи частіше ніж 3 рази зустрічалось слово)
        popular_words.append(word) #якщо умова виконується, то запишемо це слово в popular_words
print("Словник слів що зустрічаються більше 3 разів:", popular_words)